---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHookType.CreateDefaultRebarHookType(Autodesk.Revit.DB.Document)
source: html/83699313-9138-9a03-2a9a-8f7373fcd535.htm
---
# Autodesk.Revit.DB.Structure.RebarHookType.CreateDefaultRebarHookType Method

Creates a new RebarHookType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultRebarHookType(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null